package com.example.exam2512.models

import com.example.exam2512.R

class Constants {

    companion object {

        val news = arrayListOf(
            ModelNews(
                Categories.Political, "Кабинет министров решил обязать всех госслужащих пользоваться услугами только сотового оператора MegaCom. Информацию подтвердили некоторые чиновники.\n" +
                    "\n" +
                    "По их сведениям, кабмин рекомендует приобретать SIM-карты MegaCom и переходить на обслуживание этой компании в целях поддержки отечественного оператора. Госслужащим поставлены сроки — они обязаны это сделать до 1 января 2022 года.\n" +
                    "\n" +
                    "Напомним, согласно официальным данным, в Кыргызстане общая численность государственных служащих составляет не менее 18,5 тысячи человек.\n" +
                    "\n" +
                    "В самой компании MegaCom пообещали прокомментировать решение кабмина чуть позже.\n" +
                    "\n" +
                    "В июле 2021-го кабинет министров намеревался реализовать очередную программу приватизации госпредприятий и вновь поднял тему продажи ЗАО «Альфа Телеком» (торговая марка MegaCom). Он выступал за продажу 100-процентной доли акций сотового оператора. Тогда еще заместитель министра инвестиций Нурадил Баясов подтвердил эту информацию депутатам парламента.", "Кабмин решил обязать всех чиновников пользоваться только услугами MegaCom", "https://24.kg/thumbnails/31fdc/29735/242518_w473_h320.jpg"),
            ModelNews(
                Categories.Political, "В январе кыргызстанцы отдохнут с 1 по 9 января. Об этом сообщили в пресс-службе кабинета министров.\n" +
                    "\n" +
                    "По ее данным, дни будут нерабочими для граждан, работающих по графику пятидневной рабочей недели.\n" +
                    "\n" +
                    "В частности, перенесены: выходной 15 января на рабочий 4 января 2022 года (соответственно, 15 января — рабочий день вместо 4 января); выходной 26 февраля на рабочий 5 января; выходной 26 марта на рабочий 6 января.\n" +
                    "\n" +
                    "Предложено также объявить нерабочими с 1 по 9 мая следующего года. Председатель кабмина Акылбек Жапаров отметил, что окончательное решение о переносе майских праздников примут в первом квартале 2022-го.", "Будем отдыхать девять дней. Кабмин принял решение о новогодних каникулах\n", "https://cdnuploads.aa.com.tr/uploads/Contents/2021/11/28/thumbs_b_c_3a51ed34de79ff57e51681995f90a723.jpg?v=235240"),
            ModelNews(
                Categories.Political, "Уволенного за агитацию ректора ОшГУ Кудайберди Кожобекова восстановили в должности. Об этом 24.kg сообщили в Министерстве образования и науки.\n" +
                    "\n" +
                    "По его данным, распоряжение кабмина вышло 22 декабря.\n" +
                    "\n" +
                    "Напомним, 3 ноября на центральной площади южной столицы партия «Азаттык» провела мероприятие. Как выяснилось, в нем принимали участие студенты вуза. В интернете появились публикации о том, что студенты ОшГУ не по своей воле участвуют в агитационном мероприятии политорганизации.\n" +
                    "\n" +
                    "Центризбирком просил кабинет министров рассмотреть ответственность руководителей вуза и соответствие ими занимаемой должности.\n" +
                    "\n" +
                    "После на основании решения ЦИК 10 ноября кабмин освободил от должности ректора ОшГУ Кудайберди Кожобекова. Документ подписал председатель кабинета министров Акылбек Жапаров.", "Уволенного за агитацию ректора ОшГУ восстановили в должности", "https://st-1.akipress.org/st_gallery/0/1079400.a134fba93ab5863a812c81331df1a13b.jpg"),
            ModelNews(
                Categories.Political, "Состоялся телефонный разговор президентов Кыргызстана Садыра Жапарова и Азербайджана Ильхама Алиева. Об этом сообщает пресс-служба главы государства.\n" +
                    "\n" +
                    "Президенты обсудили актуальные аспекты кыргызско-азербайджанского двустороннего сотрудничества, состояние и перспективы развития взаимовыгодных связей в различных областях. Садыр Жапаров поздравил Ильхама Алиева с 60-летним юбилеем и пожелал ему крепкого здоровья, а также дальнейших успехов в ответственной государственной деятельности.\n" +
                    "\n" +
                    "Он высоко оценил совместное взаимодействие стран, основанное на прочных традициях исторической дружбы и взаимного уважения, подчеркнув большой личный вклад Ильхама Алиева в это дело.\n" +
                    "\n" +
                    "В свою очередь президент Азербайджана поблагодарил за поздравления, а также подчеркнул готовность азербайджанской стороны к продолжению наращивания взаимовыгодного сотрудничества по всем вопросам совместной повестки.", "Садыр Жапаров по телефону поздравил Ильхама Алиева с юбилеем\n", "https://kloop.kg/wp-content/uploads/2021/09/zhaparov-scaled.jpg"),
            ModelNews(
                Categories.Political, "Лидеру парламентской фракции СДПК Исе Омуркулову провели операцию в Турции. Об этом сообщает секретариат партии. \n" +
                    "\n" +
                    "Уточняется, что Исе Омуркулову проведена операция по пересадке печени. Она длилась девять часов. \n" +
                    "\n" +
                    "По словам нардепа Сайдуллы Нышанова, состояние коллеги оценивается как стабильное. В ближайшее время Иса Омуркулов вернется в Кыргызстан. \n" +
                    "\n" +
                    "Напомним, о том, что Иса Омуркулов уезжает лечиться за границу, стало известно в июне. Фракцию временно возглавил депутат Омурбек Бакиров. \n" +
                    "\n" +
                    "В марте 2021 года пересадку печени перенес также депутат парламента от фракции «Кыргызстан» Шаршенбек Абдыкеримов. Операцию провели в одной из частных клиник в Дубае (Объединенные Арабские Эмираты).  ", "Еще одному депутату парламента провели операцию по пересадке печени", "https://sputnik.kg/img/104180/76/1041807669_31:0:1084:594_1920x0_80_0_0_6d5c10dbcfc5d989e26445cc00f4a454.jpg"),

            ModelNews(
                Categories.Sport, "В Кара-Балте в Городском дворце культуры имени Владимира Ленина состоялся областной турнир по армрестлингу. Об этом 24.kg сообщили в пресс-службе мэрии города.\n" +
                    "\n" +
                    "Соревнования прошли при поддержке Федерации армрестлинга KAF.\n" +
                    "\n" +
                    "В чемпионате приняли участие более 120 спортсменов в возрасте от 18 лет из разных регионов страны. Команда Bicepsclub под руководством тренера сборной Юрия Хлопкова завоевала в общей сложности семь медалей: одно золото, одно серебро и пять бронзовых.«За помощь в организации областного турнира и вклад в развитие здорового образа жизни благодарственными письмами от фитнес-клуба Bicepsclub награждены председатель Кара-Балтинского городского кенеша Арсен Байсариев, директор ДК имени Владимира Ленина Шахийда Ахмедова и руководитель молодежного центра Самат Абилов», — отметили в муниципалитете.", "В Кара-Балте прошел областной турнир по армрестлингу", "https://24.kg/files/media/242/242523.jpeg"),
            ModelNews(
                Categories.Sport, "Национальная сборная Кыргызстана по волейболу на чемпионате Азии среди команд Центральной зоны обыграла Бангладеш. Об этом сообщает _kyrgyz_volleyball_ в Instagram.\n" +
                    "\n" +
                    "Счет — 3:0.\n" +
                    "\n" +
                    "Завтра кыргызстанки сыграют со сборной Шри-Ланки.\n" +
                    "\n" +
                    "В турнире, который проходит 23-28 декабря в Дакке (Бангладеш), участвуют шесть команд — хозяева чемпионата, Шри-Ланка, Мальдивы, Узбекистан, Непал и Кыргызстан.\n" +
                    "\n" +
                    "По регламенту турнира команды сыграют между собой в один круг. Занявшие первое и второе места сыграют в финале, третье и четвертое места разыграют бронзовые медали.", "Зональный чемпионат Азии по волейболу. Кыргызстанки обыграли команду Бангладеш", "https://24.kg/thumbnails/f853d/7cdaf/242631_w750_h_r.JPG"),
            ModelNews(
                Categories.Sport, "Кыргызстанка Айсулуу Тыныбекова признана лучшей спортсменкой в женской борьбе Азии. Об этом сообщается в Instagram UWW Asia.\n" +
                    "\n" +
                    "Объединенный мир борьбы назвал лучших спортсменов года.\n" +
                    "\n" +
                    "Айсулуу Тыныбекова завоевала серебряную медаль Олимпийских игр и золотую — чемпионата мира.\n" +
                    "\n" +
                    "Иранские борцы Мохаммад Реза Гераеи и Хассан Яздани Черати стали лучшими в греко-римском и вольном стилях соответственно.Награждение победителей состоится на генеральной ассамблее Объединенного мира борьбы по Центральной Азии в Улан-Баторе.", "Айсулуу Тыныбекова признана лучшей в Азии в женской борьбе", "https://lh3.googleusercontent.com/proxy/_9Wf1nn1-wj98M7Xo-6clZ6nNX6ND1lemxJk46o2WMIrDAbLq_ugktGUXJVH8ZRfsWLOMJuf0Zdz5nlZuH0Bs7Aex_MtWCcs1l38CVM6uuH7"),
            ModelNews(
                Categories.Sport, "Кыргызстанские спортсмены приняли участие в чемпионате и Кубке мира по таэквондо ITF. Об этом 24.kg сообщили в Федерации оригинального таэквондо ITF.По ее данным, мероприятие прошло с 11 по 19 декабря в Минске (Беларусь). На чемпионат приехали представители 40 стран.\n" +
                    "Федерацию таэквондо ITF представляли 39 спортсменов. Владислав Петренко стал бронзовым призером ЧМ среди юниоров 14-15 лет (55 килограммов). Чемпионами и призерами Кубка мира среди детей, кадетов, юниоров и взрослых участников также стали 24 кыргызстанца.", "Кыргызстанцы стали победителями и призерами Кубка мира по таэквондо ITF", "https://24.kg/files/media/242/242191.jpeg"),
            ModelNews(
                Categories.Sport, "В Бишкеке прошел международный турнир по хоккею с шайбой «Кубок мэра». Об этом 24.kg сообщили в федерации этого вида спорта.\n" +
                    "\n" +
                    "В нем участвовала 21 детско-юношеская команда из Латвии, Узбекистана, Казахстана и Кыргызстана.\n" +
                    "\n" +
                    "В категории спортсменов 2008 года рождения победу в группе одержала команда «Кайсар» из Кызылорды (Казахстан), второе место — «Торнадо» из Шымкента (Казахстан), третье — команда из Бишкека «Локомотив».\n" +
                    "\n" +
                    "В категории спортсменов 2010 года рождения первое место завоевала команда «Алга» из Бишкека, второе — команда «Туран» из Шымкента (Казахстан), третье — команда «Бинокор» из Ташкента (Узбекистан).\n" +
                    "\n" +
                    "В категории спортсменов 2012 года рождения победила команда из Латвии Baltic Wolves, второе место у команды «Алга» (Бишкек), третье — за командой «Медведи» (Алматы, Казахстан).Всего за 10 дней турнира сыграли 64 матча и забили 500 шайб.\n" +
                    "\n" +
                    "«Цель ежегодного турнира — повышение уровня профессионализма молодых игроков, развитие и популяризация хоккея с шайбой в стране, пропаганда здорового образа жизни среди молодого поколения, а также расширение и укрепление дружественных спортивных отношений между спортсменами на международном уровне», — отметили в федерации.\n" +
                    "\n", "В Бишкеке определились победители международного турнира по хоккею", "https://24.kg/files/media/242/242163.jpeg"),

            ModelNews(
                Categories.Culture, "Юлий Худяков — российский археолог и историк. Его монография \"Вооружение енисейских кыргызов VI–XII вв.\" является одним из ключевых трудов для исследователей истории кыргызов. Ученый награжден орденом \"Манас\" III степени.\n" +
                    "БИШКЕК, 24 дек — Sputnik. Сегодня на 75-м году жизни скончался известный археолог, доктор исторических наук, главный научный сотрудник Института археологии и этнографии Сибирского отделения Российской академии наук, профессор Новосибирского государственного университета Юлий Худяков. Об этом сообщается на сайте вуза.\n" +
                    "Юлий Худяков — российский археолог и историк военного дела древних и средневековых народов Южной Сибири и Центральной Азии. На основе результатов археологических экспедиций в Хакасии, Красноярском крае, Туве, на Горном Алтае, в Монголии и Китае он показал сходство материальной культуры кыргызов на всем этом пространстве. Его монография \"Вооружение енисейских кыргызов VI–XII вв.\" 1980 года издания является одним из ключевых трудов для исследователей истории кыргызов. Ученый награжден орденом \"Манас\" III степени.\n" +
                    "Историк Кыяс Молдокасымов в Facebook высоко оценил деятельность Худякова, отметив, что тот посвятил жизнь изучению истории кыргызов. От имени фонда \"Мурас\" Молдокасымов выразил глубочайшие соболезнования родным и близким ученого.", "Скончался известный ученый Юлий Худяков — изучал историю кыргызов", "https://sputnik.kg/img/103301/16/1033011678_0:0:4800:3205_1440x900_80_0_1_b105af0f54ea1bb36863f5e248b98a1c.jpg.webp?source-sid=SK_TK"),
            ModelNews(
                Categories.Culture, "Отечественный музыкант прошел в полуфинал проекта. На предыдущем этапе он исполнил хит Роя Орбисона \"Pretty Woman\".\n" +
                    "БИШКЕК, 24 дек — Sputnik. В интернете стартовал флешмоб в поддержку участника российского музыкального шоу \"Голос\" кыргызстанца Александра Волкодава.\n" +
                    "Пользователи соцсетей решили поддержать музыканта с хэштегом #СаняАлга. Организовал флешмоб Русский дом в Бишкеке.\n" +
                    "Волкодав будет бороться за выход в финал шоу с семью соперниками.\n" +
                    "Кыргызстанец прошел в полуфинал телепроекта \"Голос\" 18 декабря. В четвертьфинале подопечный Пелагеи исполнил хит Роя Орбисона \"Pretty Woman\" (\"Красотка\").", "В Сети стартовал флешмоб в поддержку участника шоу \"Голос\" из Кыргызстана", "https://sputnik.kg/img/07e4/0c/1a/1050913210_0:0:3072:2048_1440x900_80_0_1_903787873f65953b12c9430f8abef573.jpg.webp?source-sid=SK_TK"),
            ModelNews(
                Categories.Culture, "Фотография манасчи Кабы Атабекова (в центре) была сделана в 1995 году на одном из джайлоо в Чуйской области.Атабекову тогда был 71 год. Режиссер Нуртай Борбиев снимал адресный фильм, посвященный празднованию тысячелетия эпоса \"Манас\". Художественным руководителем картины был режиссер Толомуш Океев.\n" +
                    "Кинофотограф Александр Федоров, который является автором снимка, вспоминает, что они с коллегой Алимжаном Жоробаевым стали непосредственными участниками съемок.\n" +
                    "\"В те годы отечественная кинематография не финансировалась как раньше, но к тысячелетию эпоса средства были выделены. Тогда режиссеры Нуртай Борбиев и Мелис Убукеев сняли два фильма об эпосе. Манасчи Каба Атабеков снялся в первом из них. Многие манасчи, которые снимались в тех картинах, уже покинули этот мир\", — рассказал Федоров.Фильм снимали примерно полгода в Хакасии (Россия), Турции, Саудовской Аравии, а также в Кыргызстане.\n" +
                    "В том же году Каба Атабеков получил звание народного артиста КР. Умер он 25 марта 2008-го.\n" +
                    "В 1995 году юбилейные мероприятия продолжались пять дней, в них участвовали представители 70 стран, а также международных организаций. Организаторами были видные деятели культуры Кыргызстана.", "Известный манасчи во время съемок фильма в Чуйской области — фото 1995 года", "https://sputnik.kg/img/07e5/0c/10/1060245297_0:0:2048:1800_1440x900_80_0_1_389f9d9b119b770af84eb7d88cafb7b6.jpg.webp?source-sid=AF"),

            ModelNews(
                Categories.Business, "США отменят ограничения на въезд из африканских стран, где был обнаружен новый вариант коронавируса «омикрон». Власти решили, что это уже не повлияет на ситуацию, учитывая его широкое распространение в США и за их пределами, а также ожидают, что существующих вакцин будет достаточно для борьбы с «омикроном», узнали СМИ\n" +
                    "США снимут ограничения на въезд из стран Южной Африки, которые были введены из-за обнаружения там нового варианта коронавируса «омикрон», сообщил в Twitter помощник пресс-секретаря Белого дома Кевин Муньос. Ограничения перестанут действовать с  31 декабря.\n" +
                    "\n" +
                    "По его словам, это решение продиктовано рекомендацией Центров по контролю и профилактике заболеваний (CDC). «Ограничения дали нам время, чтобы изучить «омикрон», и мы знаем, что существующие вакцины работают против него, особенно с бустером», — написал он.CDC рекомендовали отменить ограничения на поездки, так как сохранение запрета не окажет существенного влияния на заболеваемость, учитывая широкое распространение COVID-19 в США, а также уверенность экспертов в том, что для борьбы с «омикроном» не потребуется специальная вакцина, так как существующих препаратов и бустеров будет достаточно, поясняли источники Reuters и CNN.\n" +
                    "\n" +
                    "По данным собеседника Reuters, ограничения вводились не для того, чтобы не допустить проникновения нового штамма в страну, а для того, чтобы сократить количество случаев заражения в первые дни и недели. Он отметил, что власти понимали, что не смогут не пустить «омикрон» в США. \n" +
                    "\n" +
                    "США 29 ноября запретили въезд почти всем иностранцам, которые в течение двух недель перед приездом побывали в ЮАР, Ботсване, Зимбабве, Намибии и еще четырех странах на юге Африки на фоне распространения нового штамма «омикрон», пишет Reuters.\n" +
                    "\n" +
                    "Ранее, 22 декабря, Роспотребнадзор по итогам работы с Минздравом ЮАР также допустил пересмотр ограничений на перелеты из-за обнаружения «омикрона» в странах Африки. Ведомство обращало внимание на то, что этот штамм COVID-19 выявлен уже более чем в 94 странах, и на «вновь полученные данные о характеристиках» «омикрона». Но пока такое решение не принято. Минздрав ЮАР, в свою очередь, заявил, что запрет на авиасообщение из-за штамма COVID-19 утратил смысл после того, как «омикрон» распространился по всему миру. ", "США снимут запрет на въезд из стран Африки после широкого распространения «омикрона»", "https://img.gazeta.ru/files3/417/14320417/Depositphotos_266204162_XL-pic_32ratio_900x600-900x600-77739.jpg"),
            ModelNews(
                Categories.Business, "Мировой суд Таганского района Москвы выписал Google и Meta оборотные штрафы 7,2 млрд рублей и почти 2 млрд рублей соответственно. Это рекордные штрафы для них в России, и IТ-гигантам придется решить, будут ли они исполнять требования закона — или сворачивать бизнес в стране\n" +
                    "Мировой суд Таганского района Москвы выписал компании Google оборотный штраф 7,22 млрд рублей, а компании Meta (Facebook) — 1,99 млрд рублей за повторное нарушение ограничения доступа к противоправным материалам. Об этом Forbes сообщил представитель Роскомнадзора. \n" +
                    "\n" +
                    "Сумма штрафа для Google рассчитана судьей, исходя из представленных суду Роскомнадзором данных о размере годовой выручки Google, объяснил информированный источник «Интерфакса». За повторное нарушение власти могут оштрафовать компанию на 5-10% совокупного размера выручки в России за календарный год, предшествующий году, когда выявили правонарушение. По данным «СПАРК-Интерфакс», выручка компании в России в 2020 году составила 85,5 млрд рублей. Выручка Meta в России официально неизвестна, однако гендиректор Лиги безопасного интернета Екатерина Мизулина оценивала ее в 39 млрд рублей.\n" +
                    "\n" +
                    "Всего в этом году без учета последнего штрафа Google оштрафовали на 37,5 млн рублей по 16 искам, из них компания выплатила только 6 млн рублей по трем искам, заявили ранее в пресс-службе Роскомнадзора. Meta за год оштрафовали на 70 млн рублей, из них компания оплатила только 26 млн рублей.\n" +
                    "\n", "Точка невозврата: чем грозят миллиардные штрафы Google и Meta", "https://static.dezeen.com/uploads/2021/11/meta-facebook-rebranding-name-news_dezeen_2364_col_hero2-1024x441.jpg"),
            ModelNews(
                Categories.Business, "Переговоры о продлении транзита газа через Украину могут начаться, когда у России будет понимание, кто и на каких условиях будет покупать топливо, заявили в МИД России. Договор между Киевом и Москвой заканчивается в 2024 году. Как считают в российском министерстве, Украина сейчас поднимает газовый вопрос лишь в политических целях.\n" +
                    "Глава второго департамента стран СНГ Министерства иностранных дел РФ Алексей Полищук заявил, что Россия будет готова начать переговоры о продлении газового транзита через ГТС Украины при трех условиях. Его слова передает РИА «Новости».Дипломат добавил, что вопросы поставок газа через украинскую газотранспортную сеть являются вопросами исключительно коммерческими. Актуальный транзитный контракт между Москвой и Киевом действует до 31 декабря 2024 года, поэтому власти Украины поднимают сейчас вопрос о его продлении в политических целях, подчеркнул глава департамента МИД.\n" +
                    "\n" +
                    "Неделю назад директор «Оператора ГТС Украины» Сергей Макогон заявил, что украинская сторона готова продлить договор с Россией о транзите газа уже сейчас.", "Украина требует продлить транзит газа. У России есть три условия","https://img.gazeta.ru/files3/521/14351521/RIAN_2967546.HR-pic4_zoom-1500x1500-58462.jpg"),
        )

        val categories = arrayListOf(
            ModelCategory(Categories.Political, R.string.political, getNewsByCategories(Categories.Political)),
            ModelCategory(Categories.Sport, R.string.sports, getNewsByCategories(Categories.Sport)),
            ModelCategory(Categories.Culture, R.string.culture, getNewsByCategories(Categories.Culture)),
            ModelCategory(Categories.Business, R.string.business, getNewsByCategories(Categories.Business))
        )


        private fun getNewsByCategories(categories: Categories): List<ModelNews> {
            return news.filter { it.category == categories }
        }
    }
}


enum class Categories {
    Political,
    Sport,
    Culture,
    Business
}